#+AUTHOR:    Anton S. Kosinov
#+TITLE:     Mental Athlete ToDo List
#+SUBTITLE:  Life in a plain text
#+EMAIL:     a.s.kosinov@gmail.com
#+LANGUAGE: en
#+STARTUP: showall
#+PROPERTY:header-args :results output :exports both
# :session :cache yes :tangle yes :comments org 
#+CATEGORY: New Article
#+TODO: TODO | MAYBE DONE CLOSED

* [#A] Time Management
  :PROPERTIES:
  :CATEGORY: MetaKnowledge
  :LAST_REPEAT: [2018-03-07 Wed 12:39]
  :END:
  - State "DONE"       from "TODO"       [2018-03-07 Wed 12:39]
  :LOGBOOK:
  CLOCK: [2018-03-07 Wed 12:39]--[2018-03-07 Wed 12:39] =>  0:00
  :END:
  <2018-03-14 Wed ++1w>

** [#A] Daily Agenda Composing
   :LOGBOOK:
   CLOCK: [2018-03-12 Mon 09:34]--[2018-03-12 Mon 09:55] =>  0:21
   :END:
   <2018-03-08 Thu ++1d>

** Agenda commands
   :PROPERTIES:
   :CATEGORY: Org-mode
   :LAST_REPEAT: [2018-03-08 Thu 13:03]
   :END:
   - State "DONE"       from "TODO"       [2018-03-08 Thu 13:03]
   :LOGBOOK:
   CLOCK: [2018-03-08 Thu 12:58]--[2018-03-08 Thu 13:02] =>  0:04
   :END:
   [[info:org#Agenda%20commands][info:org#Agenda commands]]
   <2018-03-08 Thu ++1d>

** [#B] Regular events scheduling
   :LOGBOOK:
   CLOCK: [2018-03-08 Thu 13:05]--[2018-03-08 Thu 13:13] =>  0:08
   CLOCK: [2018-03-04 Sun 17:02]--[2018-03-04 Sun 17:23] =>  0:21
   :END:
   <2018-03-06 Tue ++1d> Hardcore time-schedule isn't a silver
   bullet and I'll follow for =Emacs= innate ~priority~ varying
   approach. We'll just exclde the =natural.org= with all
   bio-rthythms out from our Agenda by =C-x ]=


* [#C] Writing
  :PROPERTIES:
  :CATEGORY: English
  :END:
  <%%(memq (calendar-day-of-week date) '(1 2 3 4 5))>

** Vocabulary
   :LOGBOOK:
   CLOCK: [2018-03-12 Mon 14:38]--[2018-03-12 Mon 15:05] =>  0:27
   :END:
   <2018-03-12 Mon 14:30-15:00>
   <2018-03-12 Mon 15:30-16:00>
** Social Networking
   :PROPERTIES:
   :CATEGORY: LinkedIn
   :END:
   <2018-03-12 Mon 11:30-12:00>

*** Private repository
    :PROPERTIES:
    :CATEGORY: BitBucket
    :END:
    :LOGBOOK:
    CLOCK: [2018-03-12 Mon 10:59]--[2018-03-12 Mon 11:28] =>  0:29
    :END:
    <2018-03-12 Mon 11:00-11:30>

    #+BEGIN_QUOTE
    Running "hg push"...
    pushing to https://Cosmic@bitbucket.org/Cosmic/stuff
    abort: http authorization required for https://bitbucket.org/Cosmic/stuff
    #+END_QUOTE
    [[file:/usr/local/hg/stuff/toolset.txt::This%20is%20a%20test%20string][startPoint]]

**** DONE Credentials
     :LOGBOOK:
     CLOCK: [2018-03-12 Mon 14:01]--[2018-03-12 Mon 14:26] =>  0:25
     :END:
     <2018-03-12 Mon 14:00-14:30>


* NoSQL
  :PROPERTIES:
  :CATEGORY: NoSQL
  :END:

** Intro
   :LOGBOOK:
   CLOCK: [2018-03-12 Mon 10:39]--[2018-03-12 Mon 10:59] =>  0:20
   :END:
   <2018-03-12 Mon 10:30-11:00>
   <2018-03-12 Mon 15:00-15:30>
   [[file:/usr/local/git/0--key/org-pub/2017-08-07-nosql.org::*The%20Main%20Purpose][The Main Purpose]]

* Emacs
  :PROPERTIES:
  :CATEGORY: Emacs
  :END:

** Elpy
   :LOGBOOK:
   CLOCK: [2018-03-12 Mon 10:14]--[2018-03-12 Mon 10:35] =>  0:21
   :END:
   <2018-03-12 Mon 10:00-10:30>
   [[file:/usr/local/git/0--key/org-pub/2017-08-03-elpy.org::*The%20Main%20Purpose][The Main Purpose]]

* FMSD
** Program Development
  :PROPERTIES:
  :CATEGORY: FMSD
  :END:
  :LOGBOOK:
  CLOCK: [2018-03-12 Mon 13:24]--[2018-03-12 Mon 13:51] =>  0:27
  :END:
   <2018-03-12 Mon 13:20-13:50>
* Python
  :PROPERTIES:
  :CATEGORY: Python
  :END:

** Concurrent Programming

*** Intro
    <2018-03-13 Tue 08:00-08:30>

*** Linux Processes Dissection
    <2018-03-13 Tue 08:30-09:00>
